// =============THE TASK 4===============

// Присвоить переменной а значение 
// в промежутке [0..15]. 
// С помощью оператора switch организовать 
// вывод чисел от a до 15.

'use sctrict';

let a = +prompt('Введите число от 0 до 15. После ввода числа программа выведет Вам диапазон чисел, начиная с Вашего.');
switch (a) {
	case 0:
	alert('Число 0.');
	case 1:
	alert('Число 1.');
	case 2:
	alert('Число 2.');
	case 3:
	alert('Число 3.');
	case 4:
	alert('Число 4.');
	case 5:
	alert('Число 5.');
	case 6:
	alert('Число 6.');
	case 7:
	alert('Число 7.');
	case 8:
	alert('Число 8.');
	case 9:
	alert('Число 9.');
	case 10:
	alert('Число 10.');
	case 11:
	alert('Число 11.');
	case 12:
	alert('Число 12.');
	case 13:
	alert('Число 13.');
	case 14:
	alert('Число 14.');
	case 15:
	alert('Число 15.');
	break;
	default:
	alert('Вы не ввели число от 0 до 15.');
}